In [1]:
import pandas as pd

In [5]:
# Series - 1D
# Dataframe - 2D
# Panel - 3D

In [6]:
data = ['US', 'MX', 'CA']
s = pd.Series(data)
s

0    US
1    MX
2    CA
dtype: object

In [7]:
s2 = pd.Series(data, [3,4,5])
s2

3    US
4    MX
5    CA
dtype: object

In [8]:
# importing data files with pandas

In [9]:
import os

In [10]:
data_file = os.path.join("Resources", "dataSet.csv")

In [13]:
data_file_pd = pd.read_csv(data_file) # read the csv
data_file_pd.head() # print first 5 rows

   id First Name Last Name Gender   Amount
0   1       Todd     Lopez      M   8067.7
1   2     Joshua     White      M   7330.1
2   3       Mary     Lewis      F  16335.0
3   4      Emily     Burns      F  12460.8
4   5  Christina    Romero      F  15271.9

In [15]:
data_file_pd["Amount"].describe()

count     1000.000000
mean     10051.323600
std       5831.230806
min          3.400000
25%       4854.875000
50%      10318.050000
75%      15117.425000
max      19987.400000
Name: Amount, dtype: float64

In [18]:
# slice dataset
data_file_pd[["Amount", "Gender"]][40:50]

     Amount Gender
40  18189.6      F
41  14613.0      M
42  19639.3      F
43  11652.8      M
44  11833.1      M
45  13146.2      F
46   4692.9      M
47   1884.4      M
48   7247.7      M
49   2234.2      F

In [21]:
# all unique valules
unique = data_file_pd["Last Name"].unique()

In [22]:
# number of unique last names
len(unique)

242

In [23]:
data_file_pd["Gender"].value_counts()

M    515
F    485
Name: Gender, dtype: int64

In [28]:
thousands = data_file_pd["Amount"] / 1000
data_file_pd["Thousands of $"] = thousands
data_file_pd.head()

   id First Name Last Name Gender   Amount  Thousands of $
0   1       Todd     Lopez      M   8067.7          8.0677
1   2     Joshua     White      M   7330.1          7.3301
2   3       Mary     Lewis      F  16335.0         16.3350
3   4      Emily     Burns      F  12460.8         12.4608
4   5  Christina    Romero      F  15271.9         15.2719

In [29]:
# deletes column
del(data_file_pd["Thousands of $"])

In [30]:
data_file_pd.head()

   id First Name Last Name Gender   Amount
0   1       Todd     Lopez      M   8067.7
1   2     Joshua     White      M   7330.1
2   3       Mary     Lewis      F  16335.0
3   4      Emily     Burns      F  12460.8
4   5  Christina    Romero      F  15271.9

In [34]:
# write dataframe to a new csv
data_file_pd.to_csv('Resources/test.csv', index=False)

In [35]:
!head Resources/test.csv

id,First Name,Last Name,Gender,Amount
1,Todd,Lopez,M,8067.7
2,Joshua,White,M,7330.1
3,Mary,Lewis,F,16335.0
4,Emily,Burns,F,12460.8
5,Christina,Romero,F,15271.9
6,Raymond,Andrews,M,7036.9
7,Sandra,Baker,F,14002.2
8,Todd,Diaz,M,10911.0
9,Alice,Burke,F,14198.8